# SQL LAB

## Before you do labs in class, try your best to write and test your sql code on labs

## Your db account

- db hostname: dm.hufs.ac.kr:3306
- id: s학번
- db name: s학번db    (학번은 자신의 학번)
- password: ***********

In [1]:
s = 0
for _ in range(10000):
    s += 0.0001
    
print(s)

0.9999999999999062

In [2]:
%load_ext sql

In [3]:
!pip install pymysql

Collecting pymysql
  Downloading PyMySQL-1.0.2-py3-none-any.whl (43 kB)
     |████████████████████████████████| 43 kB 1.0 MB/s
Installing collected packages: pymysql
Successfully installed pymysql-1.0.2

In [4]:
import getpass
user = 's201904458'
password = getpass.getpass()
host='dm.hufs.ac.kr'
database = 's201904458db'
connection_string = f'mysql+pymysql://{user}:{password}@{host}:3306/{database}'
    
%sql $connection_string

··········

'Connected: s201904458@s201904458db'

In [5]:
%%sql 

select * 
from EMPLOYEE;

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
8 rows affected.

[('John', 'B', 'Smith', '123456789', datetime.date(1965, 1, 9), '731-Fondren-Houston-TX', 'M', Decimal('36300.00'), '333445555', 5),
 ('Franklin', 'T', 'Wong', '333445555', datetime.date(1955, 12, 8), '638-Voss-Houston-TX', 'M', Decimal('44000.00'), '888665555', 5),
 ('Joyce', 'A', 'English', '453453453', datetime.date(1972, 7, 31), '5631-Rice-Houston-TX', 'F', Decimal('30250.00'), '333445555', 5),
 ('Ramesh', 'K', 'Narayan', '666884444', datetime.date(1962, 9, 15), '975-Fire-Oak-Humble-TX', 'M', Decimal('41800.00'), '333445555', 5),
 ('James', 'E', 'Borg', '888665555', datetime.date(1937, 11, 10), '450-Stone-Houston-TX', 'M', Decimal('55000.00'), None, 1),
 ('Jennifer', 'S', 'Wallace', '987654321', datetime.date(1941, 6, 20), '291-Berry-Bellaire-TX', 'F', Decimal('43000.00'), '888665555', 4),
 ('Ahmad', 'V', 'Jabbar', '987987987', datetime.date(1969, 3, 29), '980-Dallas-Houston-TX', 'M', Decimal('25000.00'), '987654321', 4),
 ('Alicia', 'J', 'Zelaya', '999887777', datetime.date(1968, 1, 19), '3321-Castle-Spring-TX', 'F', Decimal('25000.00'), '987654321', 4)]

In [6]:
%sql select * from EMPLOYEE;

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
8 rows affected.

[('John', 'B', 'Smith', '123456789', datetime.date(1965, 1, 9), '731-Fondren-Houston-TX', 'M', Decimal('36300.00'), '333445555', 5),
 ('Franklin', 'T', 'Wong', '333445555', datetime.date(1955, 12, 8), '638-Voss-Houston-TX', 'M', Decimal('44000.00'), '888665555', 5),
 ('Joyce', 'A', 'English', '453453453', datetime.date(1972, 7, 31), '5631-Rice-Houston-TX', 'F', Decimal('30250.00'), '333445555', 5),
 ('Ramesh', 'K', 'Narayan', '666884444', datetime.date(1962, 9, 15), '975-Fire-Oak-Humble-TX', 'M', Decimal('41800.00'), '333445555', 5),
 ('James', 'E', 'Borg', '888665555', datetime.date(1937, 11, 10), '450-Stone-Houston-TX', 'M', Decimal('55000.00'), None, 1),
 ('Jennifer', 'S', 'Wallace', '987654321', datetime.date(1941, 6, 20), '291-Berry-Bellaire-TX', 'F', Decimal('43000.00'), '888665555', 4),
 ('Ahmad', 'V', 'Jabbar', '987987987', datetime.date(1969, 3, 29), '980-Dallas-Houston-TX', 'M', Decimal('25000.00'), '987654321', 4),
 ('Alicia', 'J', 'Zelaya', '999887777', datetime.date(1968, 1, 19), '3321-Castle-Spring-TX', 'F', Decimal('25000.00'), '987654321', 4)]

In [7]:
%%sql

select *
from EMPLOYEE;

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
8 rows affected.

[('John', 'B', 'Smith', '123456789', datetime.date(1965, 1, 9), '731-Fondren-Houston-TX', 'M', Decimal('36300.00'), '333445555', 5),
 ('Franklin', 'T', 'Wong', '333445555', datetime.date(1955, 12, 8), '638-Voss-Houston-TX', 'M', Decimal('44000.00'), '888665555', 5),
 ('Joyce', 'A', 'English', '453453453', datetime.date(1972, 7, 31), '5631-Rice-Houston-TX', 'F', Decimal('30250.00'), '333445555', 5),
 ('Ramesh', 'K', 'Narayan', '666884444', datetime.date(1962, 9, 15), '975-Fire-Oak-Humble-TX', 'M', Decimal('41800.00'), '333445555', 5),
 ('James', 'E', 'Borg', '888665555', datetime.date(1937, 11, 10), '450-Stone-Houston-TX', 'M', Decimal('55000.00'), None, 1),
 ('Jennifer', 'S', 'Wallace', '987654321', datetime.date(1941, 6, 20), '291-Berry-Bellaire-TX', 'F', Decimal('43000.00'), '888665555', 4),
 ('Ahmad', 'V', 'Jabbar', '987987987', datetime.date(1969, 3, 29), '980-Dallas-Houston-TX', 'M', Decimal('25000.00'), '987654321', 4),
 ('Alicia', 'J', 'Zelaya', '999887777', datetime.date(1968, 1, 19), '3321-Castle-Spring-TX', 'F', Decimal('25000.00'), '987654321', 4)]

In [8]:
%sql show databases;

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
2 rows affected.

[('information_schema',), ('s201904458db',)]

In [9]:
%sql use s202100001db;

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
(pymysql.err.OperationalError) (1044, "Access denied for user 's201904458'@'%' to database 's202100001db'")
[SQL: use s202100001db;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [10]:
%sql show tables;

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
21 rows affected.

[('COURSE',),
 ('DEPARTMENT',),
 ('DEPENDENT',),
 ('DEPT_LOCATIONS',),
 ('DEPT_VIEW',),
 ('EMPLOYEE',),
 ('GRADE_REPORT',),
 ('MAJOR_GRADE_REPORT',),
 ('PREREQUISITE',),
 ('PROJECT',),
 ('PROJECT_VIEW',),
 ('PROJECT_VIEW_GT2',),
 ('RESEARCH_DEPT_VIEW',),
 ('SECTION',),
 ('STUDENT',),
 ('WORKS_ON',),
 ('WORKS_ON1',),
 ('dept',),
 ('emp',),
 ('salary_audit',),
 ('ttt',)]

In [11]:
%sql desc EMPLOYEE;

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
10 rows affected.

[('Fname', 'varchar(15)', 'NO', '', None, ''),
 ('Minit', 'char(1)', 'YES', '', None, ''),
 ('Lname', 'varchar(15)', 'NO', '', None, ''),
 ('Ssn', 'char(9)', 'NO', 'PRI', None, ''),
 ('Bdate', 'date', 'YES', '', None, ''),
 ('Address', 'varchar(30)', 'YES', '', None, ''),
 ('Sex', 'char(1)', 'YES', '', None, ''),
 ('Salary', 'decimal(10,2)', 'YES', '', None, ''),
 ('Superssn', 'char(9)', 'YES', 'MUL', None, ''),
 ('Dno', 'int(11)', 'YES', 'MUL', None, '')]

## Create companydb and load data
## This is done only ONCE; Do NOT run this cell 
## Whenever database is corrupted, run this cell

In [12]:
%%sql

SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0;
SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0;

DROP TABLE IF EXISTS DEPENDENT;
DROP TABLE IF EXISTS WORKS_ON;
DROP TABLE IF EXISTS PROJECT;
DROP TABLE IF EXISTS DEPT_LOCATIONS;
DROP TABLE IF EXISTS DEPARTMENT;
DROP TABLE IF EXISTS EMPLOYEE;

CREATE TABLE EMPLOYEE
(       Fname VARCHAR(15) NOT NULL,
        Minit CHAR,
        Lname VARCHAR(15) NOT NULL,
        Ssn CHAR(9) NOT NULL,
        Bdate DATE,
        Address VARCHAR(30),
        Sex CHAR,
        Salary DECIMAL(10, 2),
        Superssn CHAR(9),
        Dno INT,
        PRIMARY KEY (Ssn),
        FOREIGN KEY (Superssn) 
                REFERENCES EMPLOYEE(Ssn) 
                ON DELETE SET NULL
                ON UPDATE CASCADE,
        FOREIGN KEY (Dno) 
                REFERENCES DEPARTMENT(Dnumber)
                ON DELETE SET NULL
                ON UPDATE CASCADE
) ENGINE=InnoDB;

CREATE TABLE DEPARTMENT
(       Dname VARCHAR(15) NOT NULL,
        Dnumber INT NOT NULL,
        Mgrssn CHAR(9),
        Mgrstartdate DATE,
        PRIMARY KEY (Dnumber),
        UNIQUE (Dname),
        FOREIGN KEY (Mgrssn) 
                REFERENCES EMPLOYEE(Ssn)
                ON DELETE SET NULL
                ON UPDATE CASCADE
) ENGINE=InnoDB;


CREATE TABLE DEPT_LOCATIONS
(       Dnumber INT NOT NULL,
        Dlocation VARCHAR(15) NOT NULL,
        PRIMARY KEY (Dnumber, Dlocation),
        FOREIGN KEY (Dnumber)
                REFERENCES DEPARTMENT(Dnumber) 
                ON DELETE CASCADE
                ON UPDATE CASCADE
) ENGINE=InnoDB;


CREATE TABLE PROJECT
(       Pname VARCHAR(15) NOT NULL,
        Pnumber INT NOT NULL,
        Plocation VARCHAR(15),
        Dnum INT,
        PRIMARY KEY (Pnumber),
        UNIQUE (Pname),
        FOREIGN KEY (Dnum) 
                REFERENCES DEPARTMENT(Dnumber)
                ON DELETE SET NULL
                ON UPDATE CASCADE
) ENGINE=InnoDB;


CREATE TABLE WORKS_ON
(       Essn CHAR(9) NOT NULL,
        Pno INT NOT NULL,
        Hours DECIMAL(3, 1) ,
        PRIMARY KEY (Essn, Pno),
        FOREIGN KEY (Essn) 
                REFERENCES EMPLOYEE(Ssn)
                ON DELETE CASCADE
                ON UPDATE CASCADE,
        FOREIGN KEY (Pno) 
                REFERENCES PROJECT(Pnumber)
                ON DELETE CASCADE
                ON UPDATE CASCADE
) ENGINE=InnoDB;


CREATE TABLE DEPENDENT
(       Essn CHAR(9) NOT NULL,
        Dependent_name VARCHAR(15) NOT NULL,
        Sex CHAR,
        Bdate DATE,
        Relationship VARCHAR(8),
        PRIMARY KEY (Essn, Dependent_name),
        FOREIGN KEY (Essn) 
                REFERENCES EMPLOYEE(Ssn)
                ON DELETE CASCADE
                ON UPDATE CASCADE
) ENGINE=InnoDB;


insert into EMPLOYEE values
        ("John", "B", "Smith", "123456789","1965-01-09", "731-Fondren-Houston-TX", "M", 30000, "333445555", 5),
        ("Franklin", "T", "Wong", "333445555","1955-12-08", "638-Voss-Houston-TX", "M", 40000, "888665555", 5),
        ("Alicia", "J", "Zelaya", "999887777", "1968-01-19", "3321-Castle-Spring-TX", "F", 25000, "987654321", 4),
        ("Jennifer", "S", "Wallace", "987654321", "1941-06-20", "291-Berry-Bellaire-TX", "F", 43000, "888665555", 4),
        ("Ramesh", "K", "Narayan", "666884444", "1962-09-15", "975-Fire-Oak-Humble-TX", "M", 38000, "333445555", 5),
        ("Joyce", "A", "English", "453453453", "1972-07-31", "5631-Rice-Houston-TX", "F", 25000, "333445555", 5),
        ("Ahmad", "V", "Jabbar", "987987987", "1969-03-29", "980-Dallas-Houston-TX", "M", 25000, "987654321", 4),
        ("James", "E", "Borg", "888665555", "1937-11-10", "450-Stone-Houston-TX", "M", 55000, NULL, 1);


insert into DEPENDENT  values 
        (333445555, "Alice", "F","1986-04-05", "Daughter"),
        (333445555, "Theodore", "M","1983-10-25", "Son"),
        (333445555, "Joy", "F","1958-05-03", "Spouse"),
        (987654321, "Abner", "M","1942-02-28", "Spouse"),
        (123456789, "Michael", "M","1988-01-04", "Son"),
        (123456789, "Alice", "F", "1988-12-30", "Daughter"),
        (123456789, "Elizabeth", "F", "1967-05-05", "Spouse");


insert into DEPARTMENT values 
        ("Research", 5, 333445555,"1988-05-22"),
        ("Administration", 4, 987654321,"1995-01-01"),
        ("Headquarters", 1, 888665555,"1981-06-19");

insert into DEPT_LOCATIONS values 
        (1, "Houston"),
        (4, "Stafford"),
        (5, "Bellaire"),
        (5, "Sugarland"),
        (5, "Houston");


insert into PROJECT values 
        ("ProductX", 1, "Bellaire", 5),
        ("ProductY", 2, "Sugarland", 5),
        ("ProductZ", 3, "Houston", 5),
        ("Computerization", 10, "Stafford", 4),
        ("Reorganization", 20, "Houston", 1),
        ("Newbenefits", 30, "Stafford", 4);


insert into WORKS_ON values
        (123456789, 1, 32.5),
        (123456789, 2, 7.5),
        (666884444, 3, 40.0),
        (453453453, 1, 20.0),
        (453453453, 2, 20.0),
        (333445555, 2, 10.0),
        (333445555, 3, 10.0),
        (333445555, 10, 10.0),
        (333445555, 20, 10.0),
        (999887777, 30, 30.0),
        (999887777, 10, 10.0),
        (987987987, 10, 35.0),
        (987987987, 30, 5.0),
        (987654321, 30, 20.0),
        (987654321, 20, 15.0),
        (888665555, 20, NULL); 

SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS;
SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS;

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
8 rows affected.
7 rows affected.
3 rows affected.
5 rows affected.
6 rows affected.
16 rows affected.
0 rows affected.
0 rows affected.

[]

In [13]:
%sql select * from EMPLOYEE;

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
8 rows affected.

[('John', 'B', 'Smith', '123456789', datetime.date(1965, 1, 9), '731-Fondren-Houston-TX', 'M', Decimal('30000.00'), '333445555', 5),
 ('Franklin', 'T', 'Wong', '333445555', datetime.date(1955, 12, 8), '638-Voss-Houston-TX', 'M', Decimal('40000.00'), '888665555', 5),
 ('Joyce', 'A', 'English', '453453453', datetime.date(1972, 7, 31), '5631-Rice-Houston-TX', 'F', Decimal('25000.00'), '333445555', 5),
 ('Ramesh', 'K', 'Narayan', '666884444', datetime.date(1962, 9, 15), '975-Fire-Oak-Humble-TX', 'M', Decimal('38000.00'), '333445555', 5),
 ('James', 'E', 'Borg', '888665555', datetime.date(1937, 11, 10), '450-Stone-Houston-TX', 'M', Decimal('55000.00'), None, 1),
 ('Jennifer', 'S', 'Wallace', '987654321', datetime.date(1941, 6, 20), '291-Berry-Bellaire-TX', 'F', Decimal('43000.00'), '888665555', 4),
 ('Ahmad', 'V', 'Jabbar', '987987987', datetime.date(1969, 3, 29), '980-Dallas-Houston-TX', 'M', Decimal('25000.00'), '987654321', 4),
 ('Alicia', 'J', 'Zelaya', '999887777', datetime.date(1968, 1, 19), '3321-Castle-Spring-TX', 'F', Decimal('25000.00'), '987654321', 4)]

In [14]:
%sql select * from PROJECT;

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
6 rows affected.

[('ProductX', 1, 'Bellaire', 5),
 ('ProductY', 2, 'Sugarland', 5),
 ('ProductZ', 3, 'Houston', 5),
 ('Computerization', 10, 'Stafford', 4),
 ('Reorganization', 20, 'Houston', 1),
 ('Newbenefits', 30, 'Stafford', 4)]

## create table 
```
emp(ssn)
PK: ssn
```

In [15]:
%sql drop table if exists emp;

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
(pymysql.err.OperationalError) (3730, "Cannot drop table 'emp' referenced by a foreign key constraint 'dept_ibfk_1' on table 'dept'.")
[SQL: drop table if exists emp;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [16]:
%sql drop table if exists dept;

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
0 rows affected.

[]

In [17]:
%%sql

create table emp (
    ssn char(9) primary key
) engine=InnoDB;

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
(pymysql.err.OperationalError) (1050, "Table 'emp' already exists")
[SQL: create table emp (
    ssn char(9) primary key
) engine=InnoDB;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

## create table 
```
dept(dname, dnumbr, mgrssn, mgrstartdate)
K: dname, dnumber
PK: dnumber
FK: mgrssn -> emp
```

In [18]:
%%sql

create table dept (
    dname varchar(20) not null,
    dnumber integer not null,
    mgrssn char(9),
    mgrstartdate date,
    primary key (dnumber),
    unique (dname),
    foreign key (mgrssn) references emp(ssn) # 참조하는 메타데이터에 없으므로 만들어질 수 없다. #위에서 emp만들경우 오류없이 통과
        on delete cascade
) engine = InnoDB;

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
0 rows affected.

[]

In [19]:
%sql desc emp;

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
1 rows affected.

[('ssn', 'char(9)', 'NO', 'PRI', None, '')]

In [20]:
%sql desc dept;

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
4 rows affected.

[('dname', 'varchar(20)', 'NO', 'UNI', None, ''),
 ('dnumber', 'int(11)', 'NO', 'PRI', None, ''),
 ('mgrssn', 'char(9)', 'YES', 'MUL', None, ''),
 ('mgrstartdate', 'date', 'YES', '', None, '')]

In [21]:
%%sql 

# insert into emp values( '333445555' );  #  "Duplicate entry '333445555' for key 'PRIMARY'"
# insert into emp values( '987654321');
# insert into emp values( '886655555' );

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
0 rows affected.

[]

In [22]:
%%sql 

insert into emp values( '333445558' );

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
1 rows affected.

[]

In [23]:
%sql select * from emp;

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
4 rows affected.

[('333445555',), ('333445558',), ('886655555',), ('987654321',)]

In [24]:
%sql select * from dept;

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
0 rows affected.

[]

In [25]:
%%sql 
# 참조무결성 제약조건을 위반하지 않음
insert into dept values ('Research', 5, '333445555', '1988-05-02');
insert into dept values ('Administration', 4, '987654321', '1995-01-01');
insert into dept values ('Headquarters', 1, '886655555', '1981-06-19');

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [26]:
%%sql 

insert into dept values ('Researchx', 10, '333445555', '1988-05-02');   # 1일경우 integrityError primarykey 가 겹침  10으로 바꾸면 가능

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
1 rows affected.

[]

In [27]:
%%sql

select * from emp;

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
4 rows affected.

[('333445555',), ('333445558',), ('886655555',), ('987654321',)]

In [28]:
%%sql

select * from dept;

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
4 rows affected.

[('Headquarters', 1, '886655555', datetime.date(1981, 6, 19)),
 ('Administration', 4, '987654321', datetime.date(1995, 1, 1)),
 ('Research', 5, '333445555', datetime.date(1988, 5, 2)),
 ('Researchx', 10, '333445555', datetime.date(1988, 5, 2))]

In [29]:
%%sql

delete from emp;  # emp의 on delete cacade 모든 튜플이 날라감

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
4 rows affected.

[]

## Try this: MySQL comment

In [30]:
%%sql

select * 
from EMPLOYEE
where Salary >= 20000
-- comment until the end of line  # -- single line comment
 /* and dno = 5*/

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
8 rows affected.

[('John', 'B', 'Smith', '123456789', datetime.date(1965, 1, 9), '731-Fondren-Houston-TX', 'M', Decimal('30000.00'), '333445555', 5),
 ('Franklin', 'T', 'Wong', '333445555', datetime.date(1955, 12, 8), '638-Voss-Houston-TX', 'M', Decimal('40000.00'), '888665555', 5),
 ('Joyce', 'A', 'English', '453453453', datetime.date(1972, 7, 31), '5631-Rice-Houston-TX', 'F', Decimal('25000.00'), '333445555', 5),
 ('Ramesh', 'K', 'Narayan', '666884444', datetime.date(1962, 9, 15), '975-Fire-Oak-Humble-TX', 'M', Decimal('38000.00'), '333445555', 5),
 ('James', 'E', 'Borg', '888665555', datetime.date(1937, 11, 10), '450-Stone-Houston-TX', 'M', Decimal('55000.00'), None, 1),
 ('Jennifer', 'S', 'Wallace', '987654321', datetime.date(1941, 6, 20), '291-Berry-Bellaire-TX', 'F', Decimal('43000.00'), '888665555', 4),
 ('Ahmad', 'V', 'Jabbar', '987987987', datetime.date(1969, 3, 29), '980-Dallas-Houston-TX', 'M', Decimal('25000.00'), '987654321', 4),
 ('Alicia', 'J', 'Zelaya', '999887777', datetime.date(1968, 1, 19), '3321-Castle-Spring-TX', 'F', Decimal('25000.00'), '987654321', 4)]

In [31]:
%%sql 

insert into emp values( '333445555' );
insert into emp values( '987654321');
insert into emp values( '886655555' );

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [32]:
%%sql 

-- insert into dept values ('Research', 5, '333445551', '1988-05-02');
insert into dept values ('Research', 5, '333445555', '1988-05-02');
insert into dept values ('Administration', 4, '987654321', '1995-01-01');
insert into dept values ('Headquarters', 1, '886655555', '1981-06-19');

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [33]:
%%sql 

drop table ttt;

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
0 rows affected.

[]

In [34]:
%%sql

create table ttt(i int check( 1 <= i and i <= 4));

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
0 rows affected.

[]

In [35]:
%%sql 

insert into ttt values (1);

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
1 rows affected.

[]

In [36]:
%%sql 

insert into ttt values (10);

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
1 rows affected.

[]

In [37]:
%%sql

select * from ttt;

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
2 rows affected.

[(1,), (10,)]

# 10/27

salary가 50000이상이고 1961년 1월 1일 이후에 태어난 직원의 lname?

1.   테이블 이름은 case-sensitive
2.   칼럼 이름은 case-insensitive

In [38]:
%%sql
select Lname
from EMPLOYEE
where salary between 20000 AND 50000 AND Bdate >= date'1961-1-1';    # 50000이하 20000이상 일 경우

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
5 rows affected.

[('Smith',), ('English',), ('Narayan',), ('Jabbar',), ('Zelaya',)]

In [39]:
%sql select * from EMPLOYEE; -- case-sensitive 대소문자 구분함
#  case-insentive  칼럼 이름은 대소문자 구문 안함.

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
8 rows affected.

[('John', 'B', 'Smith', '123456789', datetime.date(1965, 1, 9), '731-Fondren-Houston-TX', 'M', Decimal('30000.00'), '333445555', 5),
 ('Franklin', 'T', 'Wong', '333445555', datetime.date(1955, 12, 8), '638-Voss-Houston-TX', 'M', Decimal('40000.00'), '888665555', 5),
 ('Joyce', 'A', 'English', '453453453', datetime.date(1972, 7, 31), '5631-Rice-Houston-TX', 'F', Decimal('25000.00'), '333445555', 5),
 ('Ramesh', 'K', 'Narayan', '666884444', datetime.date(1962, 9, 15), '975-Fire-Oak-Humble-TX', 'M', Decimal('38000.00'), '333445555', 5),
 ('James', 'E', 'Borg', '888665555', datetime.date(1937, 11, 10), '450-Stone-Houston-TX', 'M', Decimal('55000.00'), None, 1),
 ('Jennifer', 'S', 'Wallace', '987654321', datetime.date(1941, 6, 20), '291-Berry-Bellaire-TX', 'F', Decimal('43000.00'), '888665555', 4),
 ('Ahmad', 'V', 'Jabbar', '987987987', datetime.date(1969, 3, 29), '980-Dallas-Houston-TX', 'M', Decimal('25000.00'), '987654321', 4),
 ('Alicia', 'J', 'Zelaya', '999887777', datetime.date(1968, 1, 19), '3321-Castle-Spring-TX', 'F', Decimal('25000.00'), '987654321', 4)]

In [40]:
%%sql

SELECT Lname
FROM EMPLOYEE
WHERE Salary >= 30000 and date'1961-1-1';

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
5 rows affected.

[('Smith',), ('Wong',), ('Narayan',), ('Borg',), ('Wallace',)]

In [41]:
%%sql

SELECT Lname
FROM EMPLOYEE
WHERE Salary >= 30000 AND BDATE > date'..........';

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
(pymysql.err.OperationalError) (1525, "Incorrect DATE value: '..........'")
[SQL: SELECT Lname
FROM EMPLOYEE
WHERE Salary >= 30000 AND BDATE > date'..........';]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

## Try this:
```
select * 
from EMPLOYEE e, DEPARTMENT d, PROJECT p
```

In [42]:
%%sql

select count(*) 
from EMPLOYEE, DEPARTMENT, PROJECT;

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
1 rows affected.

[(144,)]

## LAB 1: ‘Research’ 부서에서 일하는 모든 종업원들의 이름과 주소를 검색하시오.

In [43]:
%%sql

select fname, lname, address
from EMPLOYEE, DEPARTMENT
where dname = 'Research' and dnumber=dno;

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
4 rows affected.

[('John', 'Smith', '731-Fondren-Houston-TX'),
 ('Franklin', 'Wong', '638-Voss-Houston-TX'),
 ('Joyce', 'English', '5631-Rice-Houston-TX'),
 ('Ramesh', 'Narayan', '975-Fire-Oak-Humble-TX')]

## LAB 2 :  salary가 30000 이상 50000이하인 직원의 lname?

In [44]:
%%sql

select lname
from EMPLOYEE
where  Salary >= 30000 and Salary <= 50000;

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
4 rows affected.

[('Smith',), ('Wong',), ('Narayan',), ('Wallace',)]

In [45]:
%%sql

select lname
from EMPLOYEE
where  Salary between 30000 and 50000;

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
4 rows affected.

[('Smith',), ('Wong',), ('Narayan',), ('Wallace',)]

## LAB 3: 4번 또는 5번 부서의 남자 직원의 lname?

In [46]:
%%sql

select lname
from EMPLOYEE
where Sex = 'M' and (Dno = 4 or Dno = 5);

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
4 rows affected.

[('Jabbar',), ('Smith',), ('Wong',), ('Narayan',)]

## LAB 4: 5번 부서에 근무하는 직원의 부양가족의 이름?

In [47]:
%%sql
select de.Dependent_name
from EMPLOYEE e, DEPENDENT de
where e.Dno = '5' and e.Ssn = de.Essn

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
6 rows affected.

[('Alice',), ('Elizabeth',), ('Michael',), ('Alice',), ('Joy',), ('Theodore',)]

## LAB 5: 'Research' 부서에 근무하는 직원의 부양가족의 이름?

In [48]:
%%sql

explain
select Dependent_name
from DEPENDENT, EMPLOYEE, DEPARTMENT
where Dnumber = Dno and Ssn = Essn and Dname = 'Research' ;

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
3 rows affected.

[(1, 'SIMPLE', 'DEPARTMENT', None, 'const', 'PRIMARY,Dname', 'Dname', '62', 'const', 1, 100.0, 'Using index'),
 (1, 'SIMPLE', 'EMPLOYEE', None, 'ref', 'PRIMARY,Dno', 'Dno', '5', 'const', 4, 100.0, 'Using index'),
 (1, 'SIMPLE', 'DEPENDENT', None, 'ref', 'PRIMARY', 'PRIMARY', '36', 's201904458db.EMPLOYEE.Ssn', 1, 100.0, 'Using index')]

## LAB 6: James Borg의 직접 부하직원의 lname은?

In [49]:
%%sql 

select e.lname
from EMPLOYEE e, EMPLOYEE j
where j.lname = 'Borg' and j.fname = 'James' and j.ssn = e.superssn;

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
2 rows affected.

[('Wong',), ('Wallace',)]

## LAB 7: James Borg의 부하직원과 그 부하직원의 부하직원의 lname를 찾으시오.

In [50]:
%%sql

select e.lname
from EMPLOYEE e, EMPLOYEE j
where j.lname = 'Borg' and j.fname = 'James' and j.ssn = e.superssn

union all

select k.lname
from EMPLOYEE e, EMPLOYEE j, EMPLOYEE k
where e.lname = 'Borg' and e.fname = 'James' and e.ssn = j.superssn and j.ssn = k.superssn;

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
7 rows affected.

[('Wong',),
 ('Wallace',),
 ('Smith',),
 ('English',),
 ('Narayan',),
 ('Jabbar',),
 ('Zelaya',)]

In [51]:
%%sql
select e2.ssn
from EMPLOYEE e, EMPLOYEE e1, EMPLOYEE e2
where e.Fname='James' and e.Lname='Borg' and e.ssn=e1.superssn and e1.ssn=e2.superssn
union
select e.ssn
from EMPLOYEE e, EMPLOYEE j
where j.lname = 'Borg' and j.fname = 'James' and e.superssn=j.ssn

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
7 rows affected.

[('123456789',),
 ('453453453',),
 ('666884444',),
 ('987987987',),
 ('999887777',),
 ('333445555',),
 ('987654321',)]

## Try this: DISTINCT

In [52]:
%sql select sex from EMPLOYEE;

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
8 rows affected.

[('M',), ('M',), ('F',), ('M',), ('M',), ('F',), ('M',), ('F',)]

In [53]:
%sql select distinct sex from EMPLOYEE;

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
2 rows affected.

[('M',), ('F',)]

### Do we need distinct
```
select distinct salary, ssn from EMPLOYEE;
```

In [54]:
%%sql

select distinct ssn, salary from EMPLOYEE;

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
8 rows affected.

[('123456789', Decimal('30000.00')),
 ('333445555', Decimal('40000.00')),
 ('453453453', Decimal('25000.00')),
 ('666884444', Decimal('38000.00')),
 ('888665555', Decimal('55000.00')),
 ('987654321', Decimal('43000.00')),
 ('987987987', Decimal('25000.00')),
 ('999887777', Decimal('25000.00'))]

#### Answer: No

### Do we need distinct
```
select ssn, dname
from EMPLOYEE e, DEPARTMENT d, PROJECT p
where e.ssn = d.mgrssn and d.dnumber = p.dnum;
```

In [55]:
%%sql

select ssn, dname
from EMPLOYEE e, DEPARTMENT d, PROJECT p
where e.ssn = d.mgrssn and d.dnumber = p.dnum;

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
6 rows affected.

[('888665555', 'Headquarters'),
 ('987654321', 'Administration'),
 ('987654321', 'Administration'),
 ('333445555', 'Research'),
 ('333445555', 'Research'),
 ('333445555', 'Research')]

### Answer: Yes

### Do we need distinct
```
select ssn, pno
from EMPLOYEE e, WORKS_ON, PROJECT p
```

In [56]:
%%sql

select ssn, pno
from EMPLOYEE e, WORKS_ON, PROJECT p

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
768 rows affected.

[('888665555', 1),
 ('888665555', 1),
 ('888665555', 1),
 ('888665555', 1),
 ('888665555', 1),
 ('888665555', 1),
 ('987654321', 1),
 ('987654321', 1),
 ('987654321', 1),
 ('987654321', 1),
 ('987654321', 1),
 ('987654321', 1),
 ('987987987', 1),
 ('987987987', 1),
 ('987987987', 1),
 ('987987987', 1),
 ('987987987', 1),
 ('987987987', 1),
 ('999887777', 1),
 ('999887777', 1),
 ('999887777', 1),
 ('999887777', 1),
 ('999887777', 1),
 ('999887777', 1),
 ('123456789', 1),
 ('123456789', 1),
 ('123456789', 1),
 ('123456789', 1),
 ('123456789', 1),
 ('123456789', 1),
 ('333445555', 1),
 ('333445555', 1),
 ('333445555', 1),
 ('333445555', 1),
 ('333445555', 1),
 ('333445555', 1),
 ('453453453', 1),
 ('453453453', 1),
 ('453453453', 1),
 ('453453453', 1),
 ('453453453', 1),
 ('453453453', 1),
 ('666884444', 1),
 ('666884444', 1),
 ('666884444', 1),
 ('666884444', 1),
 ('666884444', 1),
 ('666884444', 1),
 ('888665555', 1),
 ('888665555', 1),
 ('888665555', 1),
 ('888665555', 1),
 ('888665555', 1),
 ('888665555', 1),
 ('987654321', 1),
 ('987654321', 1),
 ('987654321', 1),
 ('987654321', 1),
 ('987654321', 1),
 ('987654321', 1),
 ('987987987', 1),
 ('987987987', 1),
 ('987987987', 1),
 ('987987987', 1),
 ('987987987', 1),
 ('987987987', 1),
 ('999887777', 1),
 ('999887777', 1),
 ('999887777', 1),
 ('999887777', 1),
 ('999887777', 1),
 ('999887777', 1),
 ('123456789', 1),
 ('123456789', 1),
 ('123456789', 1),
 ('123456789', 1),
 ('123456789', 1),
 ('123456789', 1),
 ('333445555', 1),
 ('333445555', 1),
 ('333445555', 1),
 ('333445555', 1),
 ('333445555', 1),
 ('333445555', 1),
 ('453453453', 1),
 ('453453453', 1),
 ('453453453', 1),
 ('453453453', 1),
 ('453453453', 1),
 ('453453453', 1),
 ('666884444', 1),
 ('666884444', 1),
 ('666884444', 1),
 ('666884444', 1),
 ('666884444', 1),
 ('666884444', 1),
 ('888665555', 2),
 ('888665555', 2),
 ('888665555', 2),
 ('888665555', 2),
 ('888665555', 2),
 ('888665555', 2),
 ('987654321', 2),
 ('987654321', 2),
 ('987654321', 2),
 ('987654321', 2),
 ('987654321', 2),
 ('987654321', 2),
 ('987987987', 2),
 ('987987987', 2),
 ('987987987', 2),
 ('987987987', 2),
 ('987987987', 2),
 ('987987987', 2),
 ('999887777', 2),
 ('999887777', 2),
 ('999887777', 2),
 ('999887777', 2),
 ('999887777', 2),
 ('999887777', 2),
 ('123456789', 2),
 ('123456789', 2),
 ('123456789', 2),
 ('123456789', 2),
 ('123456789', 2),
 ('123456789', 2),
 ('333445555', 2),
 ('333445555', 2),
 ('333445555', 2),
 ('333445555', 2),
 ('333445555', 2),
 ('333445555', 2),
 ('453453453', 2),
 ('453453453', 2),
 ('453453453', 2),
 ('453453453', 2),
 ('453453453', 2),
 ('453453453', 2),
 ('666884444', 2),
 ('666884444', 2),
 ('666884444', 2),
 ('666884444', 2),
 ('666884444', 2),
 ('666884444', 2),
 ('888665555', 2),
 ('888665555', 2),
 ('888665555', 2),
 ('888665555', 2),
 ('888665555', 2),
 ('888665555', 2),
 ('987654321', 2),
 ('987654321', 2),
 ('987654321', 2),
 ('987654321', 2),
 ('987654321', 2),
 ('987654321', 2),
 ('987987987', 2),
 ('987987987', 2),
 ('987987987', 2),
 ('987987987', 2),
 ('987987987', 2),
 ('987987987', 2),
 ('999887777', 2),
 ('999887777', 2),
 ('999887777', 2),
 ('999887777', 2),
 ('999887777', 2),
 ('999887777', 2),
 ('123456789', 2),
 ('123456789', 2),
 ('123456789', 2),
 ('123456789', 2),
 ('123456789', 2),
 ('123456789', 2),
 ('333445555', 2),
 ('333445555', 2),
 ('333445555', 2),
 ('333445555', 2),
 ('333445555', 2),
 ('333445555', 2),
 ('453453453', 2),
 ('453453453', 2),
 ('453453453', 2),
 ('453453453', 2),
 ('453453453', 2),
 ('453453453', 2),
 ('666884444', 2),
 ('666884444', 2),
 ('666884444', 2),
 ('666884444', 2),
 ('666884444', 2),
 ('666884444', 2),
 ('888665555', 2),
 ('888665555', 2),
 ('888665555', 2),
 ('888665555', 2),
 ('888665555', 2),
 ('888665555', 2),
 ('987654321', 2),
 ('987654321', 2),
 ('987654321', 2),
 ('987654321', 2),
 ('987654321', 2),
 ('987654321', 2),
 ('987987987', 2),
 ('987987987', 2),
 ('987987987', 2),
 ('987987987', 2),
 ('987987987', 2),
 ('987987987', 2),
 ('999887777', 2),
 ('999887777', 2),
 ('999887777', 2),
 ('999887777', 2),
 ('999887777', 2),
 ('999887777', 2),
 ('123456789', 2),
 ('123456789', 2),
 ('123456789', 2),
 ('123456789', 2),
 ('123456789', 2),
 ('123456789', 2),
 ('333445555', 2),
 ('333445555', 2),
 ('333445555', 2),
 ('333445555', 2),
 ('333445555', 2),
 ('333445555', 2),
 ('453453453', 2),
 ('453453453', 2),
 ('453453453', 2),
 ('453453453', 2),
 ('453453453', 2),
 ('453453453', 2),
 ('666884444', 2),
 ('666884444', 2),
 ('666884444', 2),
 ('666884444', 2),
 ('666884444', 2),
 ('666884444', 2),
 ('888665555', 3),
 ('888665555', 3),
 ('888665555', 3),
 ('888665555', 3),
 ('888665555', 3),
 ('888665555', 3),
 ('987654321', 3),
 ('987654321', 3),
 ('987654321', 3),
 ('987654321', 3),
 ('987654321', 3),
 ('987654321', 3),
 ('987987987', 3),
 ('987987987', 3),
 ('987987987', 3),
 ('987987987', 3),
 ('987987987', 3),
 ('987987987', 3),
 ('999887777', 3),
 ('999887777', 3),
 ('999887777', 3),
 ('999887777', 3),
 ('999887777', 3),
 ('999887777', 3),
 ('123456789', 3),
 ('123456789', 3),
 ('123456789', 3),
 ('123456789', 3),
 ('123456789', 3),
 ('123456789', 3),
 ('333445555', 3),
 ('333445555', 3),
 ('333445555', 3),
 ('333445555', 3),
 ('333445555', 3),
 ('333445555', 3),
 ('453453453', 3),
 ('453453453', 3),
 ('453453453', 3),
 ('453453453', 3),
 ('453453453', 3),
 ('453453453', 3),
 ('666884444', 3),
 ('666884444', 3),
 ('666884444', 3),
 ('666884444', 3),
 ('666884444', 3),
 ('666884444', 3),
 ('888665555', 3),
 ('888665555', 3),
 ('888665555', 3),
 ('888665555', 3),
 ('888665555', 3),
 ('888665555', 3),
 ('987654321', 3),
 ('987654321', 3),
 ('987654321', 3),
 ('987654321', 3),
 ('987654321', 3),
 ('987654321', 3),
 ('987987987', 3),
 ('987987987', 3),
 ('987987987', 3),
 ('987987987', 3),
 ('987987987', 3),
 ('987987987', 3),
 ('999887777', 3),
 ('999887777', 3),
 ('999887777', 3),
 ('999887777', 3),
 ('999887777', 3),
 ('999887777', 3),
 ('123456789', 3),
 ('123456789', 3),
 ('123456789', 3),
 ('123456789', 3),
 ('123456789', 3),
 ('123456789', 3),
 ('333445555', 3),
 ('333445555', 3),
 ('333445555', 3),
 ('333445555', 3),
 ('333445555', 3),
 ('333445555', 3),
 ('453453453', 3),
 ('453453453', 3),
 ('453453453', 3),
 ('453453453', 3),
 ('453453453', 3),
 ('453453453', 3),
 ('666884444', 3),
 ('666884444', 3),
 ('666884444', 3),
 ('666884444', 3),
 ('666884444', 3),
 ('666884444', 3),
 ('888665555', 10),
 ('888665555', 10),
 ('888665555', 10),
 ('888665555', 10),
 ('888665555', 10),
 ('888665555', 10),
 ('987654321', 10),
 ('987654321', 10),
 ('987654321', 10),
 ('987654321', 10),
 ('987654321', 10),
 ('987654321', 10),
 ('987987987', 10),
 ('987987987', 10),
 ('987987987', 10),
 ('987987987', 10),
 ('987987987', 10),
 ('987987987', 10),
 ('999887777', 10),
 ('999887777', 10),
 ('999887777', 10),
 ('999887777', 10),
 ('999887777', 10),
 ('999887777', 10),
 ('123456789', 10),
 ('123456789', 10),
 ('123456789', 10),
 ('123456789', 10),
 ('123456789', 10),
 ('123456789', 10),
 ('333445555', 10),
 ('333445555', 10),
 ('333445555', 10),
 ('333445555', 10),
 ('333445555', 10),
 ('333445555', 10),
 ('453453453', 10),
 ('453453453', 10),
 ('453453453', 10),
 ('453453453', 10),
 ('453453453', 10),
 ('453453453', 10),
 ('666884444', 10),
 ('666884444', 10),
 ('666884444', 10),
 ('666884444', 10),
 ('666884444', 10),
 ('666884444', 10),
 ('888665555', 10),
 ('888665555', 10),
 ('888665555', 10),
 ('888665555', 10),
 ('888665555', 10),
 ('888665555', 10),
 ('987654321', 10),
 ('987654321', 10),
 ('987654321', 10),
 ('987654321', 10),
 ('987654321', 10),
 ('987654321', 10),
 ('987987987', 10),
 ('987987987', 10),
 ('987987987', 10),
 ('987987987', 10),
 ('987987987', 10),
 ('987987987', 10),
 ('999887777', 10),
 ('999887777', 10),
 ('999887777', 10),
 ('999887777', 10),
 ('999887777', 10),
 ('999887777', 10),
 ('123456789', 10),
 ('123456789', 10),
 ('123456789', 10),
 ('123456789', 10),
 ('123456789', 10),
 ('123456789', 10),
 ('333445555', 10),
 ('333445555', 10),
 ('333445555', 10),
 ('333445555', 10),
 ('333445555', 10),
 ('333445555', 10),
 ('453453453', 10),
 ('453453453', 10),
 ('453453453', 10),
 ('453453453', 10),
 ('453453453', 10),
 ('453453453', 10),
 ('666884444', 10),
 ('666884444', 10),
 ('666884444', 10),
 ('666884444', 10),
 ('666884444', 10),
 ('666884444', 10),
 ('888665555', 10),
 ('888665555', 10),
 ('888665555', 10),
 ('888665555', 10),
 ('888665555', 10),
 ('888665555', 10),
 ('987654321', 10),
 ('987654321', 10),
 ('987654321', 10),
 ('987654321', 10),
 ('987654321', 10),
 ('987654321', 10),
 ('987987987', 10),
 ('987987987', 10),
 ('987987987', 10),
 ('987987987', 10),
 ('987987987', 10),
 ('987987987', 10),
 ('999887777', 10),
 ('999887777', 10),
 ('999887777', 10),
 ('999887777', 10),
 ('999887777', 10),
 ('999887777', 10),
 ('123456789', 10),
 ('123456789', 10),
 ('123456789', 10),
 ('123456789', 10),
 ('123456789', 10),
 ('123456789', 10),
 ('333445555', 10),
 ('333445555', 10),
 ('333445555', 10),
 ('333445555', 10),
 ('333445555', 10),
 ('333445555', 10),
 ('453453453', 10),
 ('453453453', 10),
 ('453453453', 10),
 ('453453453', 10),
 ('453453453', 10),
 ('453453453', 10),
 ('666884444', 10),
 ('666884444', 10),
 ('666884444', 10),
 ('666884444', 10),
 ('666884444', 10),
 ('666884444', 10),
 ('888665555', 20),
 ('888665555', 20),
 ('888665555', 20),
 ('888665555', 20),
 ('888665555', 20),
 ('888665555', 20),
 ('987654321', 20),
 ('987654321', 20),
 ('987654321', 20),
 ('987654321', 20),
 ('987654321', 20),
 ('987654321', 20),
 ('987987987', 20),
 ('987987987', 20),
 ('987987987', 20),
 ('987987987', 20),
 ('987987987', 20),
 ('987987987', 20),
 ('999887777', 20),
 ('999887777', 20),
 ('999887777', 20),
 ('999887777', 20),
 ('999887777', 20),
 ('999887777', 20),
 ('123456789', 20),
 ('123456789', 20),
 ('123456789', 20),
 ('123456789', 20),
 ('123456789', 20),
 ('123456789', 20),
 ('333445555', 20),
 ('333445555', 20),
 ('333445555', 20),
 ('333445555', 20),
 ('333445555', 20),
 ('333445555', 20),
 ('453453453', 20),
 ('453453453', 20),
 ('453453453', 20),
 ('453453453', 20),
 ('453453453', 20),
 ('453453453', 20),
 ('666884444', 20),
 ('666884444', 20),
 ('666884444', 20),
 ('666884444', 20),
 ('666884444', 20),
 ('666884444', 20),
 ('888665555', 20),
 ('888665555', 20),
 ('888665555', 20),
 ('888665555', 20),
 ('888665555', 20),
 ('888665555', 20),
 ('987654321', 20),
 ('987654321', 20),
 ('987654321', 20),
 ('987654321', 20),
 ('987654321', 20),
 ('987654321', 20),
 ('987987987', 20),
 ('987987987', 20),
 ('987987987', 20),
 ('987987987', 20),
 ('987987987', 20),
 ('987987987', 20),
 ('999887777', 20),
 ('999887777', 20),
 ('999887777', 20),
 ('999887777', 20),
 ('999887777', 20),
 ('999887777', 20),
 ('123456789', 20),
 ('123456789', 20),
 ('123456789', 20),
 ('123456789', 20),
 ('123456789', 20),
 ('123456789', 20),
 ('333445555', 20),
 ('333445555', 20),
 ('333445555', 20),
 ('333445555', 20),
 ('333445555', 20),
 ('333445555', 20),
 ('453453453', 20),
 ('453453453', 20),
 ('453453453', 20),
 ('453453453', 20),
 ('453453453', 20),
 ('453453453', 20),
 ('666884444', 20),
 ('666884444', 20),
 ('666884444', 20),
 ('666884444', 20),
 ('666884444', 20),
 ('666884444', 20),
 ('888665555', 20),
 ('888665555', 20),
 ('888665555', 20),
 ('888665555', 20),
 ('888665555', 20),
 ('888665555', 20),
 ('987654321', 20),
 ('987654321', 20),
 ('987654321', 20),
 ('987654321', 20),
 ('987654321', 20),
 ('987654321', 20),
 ('987987987', 20),
 ('987987987', 20),
 ('987987987', 20),
 ('987987987', 20),
 ('987987987', 20),
 ('987987987', 20),
 ('999887777', 20),
 ('999887777', 20),
 ('999887777', 20),
 ('999887777', 20),
 ('999887777', 20),
 ('999887777', 20),
 ('123456789', 20),
 ('123456789', 20),
 ('123456789', 20),
 ('123456789', 20),
 ('123456789', 20),
 ('123456789', 20),
 ('333445555', 20),
 ('333445555', 20),
 ('333445555', 20),
 ('333445555', 20),
 ('333445555', 20),
 ('333445555', 20),
 ('453453453', 20),
 ('453453453', 20),
 ('453453453', 20),
 ('453453453', 20),
 ('453453453', 20),
 ('453453453', 20),
 ('666884444', 20),
 ('666884444', 20),
 ('666884444', 20),
 ('666884444', 20),
 ('666884444', 20),
 ('666884444', 20),
 ('888665555', 30),
 ('888665555', 30),
 ('888665555', 30),
 ('888665555', 30),
 ('888665555', 30),
 ('888665555', 30),
 ('987654321', 30),
 ('987654321', 30),
 ('987654321', 30),
 ('987654321', 30),
 ('987654321', 30),
 ('987654321', 30),
 ('987987987', 30),
 ('987987987', 30),
 ('987987987', 30),
 ('987987987', 30),
 ('987987987', 30),
 ('987987987', 30),
 ('999887777', 30),
 ('999887777', 30),
 ('999887777', 30),
 ('999887777', 30),
 ('999887777', 30),
 ('999887777', 30),
 ('123456789', 30),
 ('123456789', 30),
 ('123456789', 30),
 ('123456789', 30),
 ('123456789', 30),
 ('123456789', 30),
 ('333445555', 30),
 ('333445555', 30),
 ('333445555', 30),
 ('333445555', 30),
 ('333445555', 30),
 ('333445555', 30),
 ('453453453', 30),
 ('453453453', 30),
 ('453453453', 30),
 ('453453453', 30),
 ('453453453', 30),
 ('453453453', 30),
 ('666884444', 30),
 ('666884444', 30),
 ('666884444', 30),
 ('666884444', 30),
 ('666884444', 30),
 ('666884444', 30),
 ('888665555', 30),
 ('888665555', 30),
 ('888665555', 30),
 ('888665555', 30),
 ('888665555', 30),
 ('888665555', 30),
 ('987654321', 30),
 ('987654321', 30),
 ('987654321', 30),
 ('987654321', 30),
 ('987654321', 30),
 ('987654321', 30),
 ('987987987', 30),
 ('987987987', 30),
 ('987987987', 30),
 ('987987987', 30),
 ('987987987', 30),
 ('987987987', 30),
 ('999887777', 30),
 ('999887777', 30),
 ('999887777', 30),
 ('999887777', 30),
 ('999887777', 30),
 ('999887777', 30),
 ('123456789', 30),
 ('123456789', 30),
 ('123456789', 30),
 ('123456789', 30),
 ('123456789', 30),
 ('123456789', 30),
 ('333445555', 30),
 ('333445555', 30),
 ('333445555', 30),
 ('333445555', 30),
 ('333445555', 30),
 ('333445555', 30),
 ('453453453', 30),
 ('453453453', 30),
 ('453453453', 30),
 ('453453453', 30),
 ('453453453', 30),
 ('453453453', 30),
 ('666884444', 30),
 ('666884444', 30),
 ('666884444', 30),
 ('666884444', 30),
 ('666884444', 30),
 ('666884444', 30),
 ('888665555', 30),
 ('888665555', 30),
 ('888665555', 30),
 ('888665555', 30),
 ('888665555', 30),
 ('888665555', 30),
 ('987654321', 30),
 ('987654321', 30),
 ('987654321', 30),
 ('987654321', 30),
 ('987654321', 30),
 ('987654321', 30),
 ('987987987', 30),
 ('987987987', 30),
 ('987987987', 30),
 ('987987987', 30),
 ('987987987', 30),
 ('987987987', 30),
 ('999887777', 30),
 ('999887777', 30),
 ('999887777', 30),
 ('999887777', 30),
 ('999887777', 30),
 ('999887777', 30),
 ('123456789', 30),
 ('123456789', 30),
 ('123456789', 30),
 ('123456789', 30),
 ('123456789', 30),
 ('123456789', 30),
 ('333445555', 30),
 ('333445555', 30),
 ('333445555', 30),
 ('333445555', 30),
 ('333445555', 30),
 ('333445555', 30),
 ('453453453', 30),
 ('453453453', 30),
 ('453453453', 30),
 ('453453453', 30),
 ('453453453', 30),
 ('453453453', 30),
 ('666884444', 30),
 ('666884444', 30),
 ('666884444', 30),
 ('666884444', 30),
 ('666884444', 30),
 ('666884444', 30)]

### Answer: Yes

### Do we need distinct
```
select pnumber
from EMPLOYEE e, DEPARTMENT d, PROJECT p
where e.ssn = d.mgrssn and d.dnumber = p.dnum;
```

### Answer: No

## Try this: UNION과 UNION ALL의 차이

In [57]:
%%sql

(select ssn from EMPLOYEE) union all (select essn from DEPENDENT);

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
15 rows affected.

[('888665555',),
 ('987654321',),
 ('987987987',),
 ('999887777',),
 ('123456789',),
 ('333445555',),
 ('453453453',),
 ('666884444',),
 ('123456789',),
 ('123456789',),
 ('123456789',),
 ('333445555',),
 ('333445555',),
 ('333445555',),
 ('987654321',)]

In [58]:
%%sql

(select ssn from EMPLOYEE) union (select essn from DEPENDENT);

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
8 rows affected.

[('888665555',),
 ('987654321',),
 ('987987987',),
 ('999887777',),
 ('123456789',),
 ('333445555',),
 ('453453453',),
 ('666884444',)]

## Try this: MySQL은 intersect와 except를 지원하지 않음

In [59]:
%%sql

(select ssn from EMPLOYEE) intersect (select essn from DEPENDENT);

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
(pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'intersect (select essn from DEPENDENT)' at line 1")
[SQL: (select ssn from EMPLOYEE) intersect (select essn from DEPENDENT);]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [60]:
%%sql

(select ssn from EMPLOYEE) minus (select essn from DEPENDENT);

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
(pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'minus (select essn from DEPENDENT)' at line 1")
[SQL: (select ssn from EMPLOYEE) minus (select essn from DEPENDENT);]
(Background on this error at: https://sqlalche.me/e/14/f405)

### Use exists instead

In [61]:
%%sql

select ssn 
from EMPLOYEE e
where not exists (select * from DEPENDENT de where e.ssn = de.essn)

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
5 rows affected.

[('888665555',),
 ('987987987',),
 ('999887777',),
 ('453453453',),
 ('666884444',)]

## LAB 8: Smith가 관리자인 projects 또는 Smith가 참여하는 projects

In [62]:
%%sql

select p.Pname
from EMPLOYEE e, PROJECT p, DEPARTMENT d
where e.Lname ='Smith' and d.mgrssn = e.Ssn and d.Dnumber = p.Dnum
union 
select p.Pname
from EMPLOYEE e, WORKS_ON wo,  PROJECT p
where e.Lname ='Smith' and wo.Essn= e.Ssn and wo.Pno = p.Pnumber

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
2 rows affected.

[('ProductX',), ('ProductY',)]

## LAB 9: 1968년 1월 1일 이후 1월달에 태어났고 TX에 주소가 있는 직원은?

In [63]:
%%sql

select e.Fname, e.Lname from EMPLOYEE e
where e.Address LIKE '%TX%' and e.Bdate like '%1968-01%'

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
1 rows affected.

[('Alicia', 'Zelaya')]

In [64]:
%%sql

select e.Fname, e.Lname from EMPLOYEE e
where e.Address LIKE '%TX%' and DATE_FORMAT (e.Bdate,"%Y") like '%1968'

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
1 rows affected.

[('Alicia', 'Zelaya')]

## Try this

In [65]:
%sql select 'cadfasdfaad' like '%a_';

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
1 rows affected.

[(1,)]

In [66]:
%%sql

select 1+2+3 from dual; -- Oracle style

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
1 rows affected.

[(6,)]

### Look at functions and operators part

https://dev.mysql.com/doc/refman/8.0/en/

In [67]:
%sql select sha2('pasalalkasJDL;ASDF;ASLDJFASDFJKasdl;AL;SDKMllal', 256);

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
1 rows affected.

[('6c56abebf4525b7adc0524c5bd264a0034adfc66554bb62992809207685367d0',)]

In [68]:
import math

math.log10(2**256)

77.06367888997919

In [69]:
%sql select sha('password');

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
1 rows affected.

[('5baa61e4c9b93f3f0682250b6cf8331b7ee68fd8',)]

In [70]:
%sql select truncate(1/3, 2)

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
1 rows affected.

[(Decimal('0.33'),)]

In [71]:
%sql select now();

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
1 rows affected.

[(datetime.datetime(2021, 12, 15, 23, 53, 55),)]

In [72]:
%sql select 'abc Houston,     TX, abc' regexp 'Houston *, *TX'

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
1 rows affected.

[(1,)]

In [73]:
%sql select 'aaaaaabdef' regexp '^(a|b|c)*def$'

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
1 rows affected.

[(1,)]

In [74]:
%%sql 

select dname, group_concat(lname) as names_in_dept
from DEPARTMENT d, EMPLOYEE e
where d.dnumber = e.dno
group by dnumber

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
3 rows affected.

[('Headquarters', 'Borg'),
 ('Administration', 'Wallace,Jabbar,Zelaya'),
 ('Research', 'Smith,Wong,English,Narayan')]

In [75]:
%%sql 

select lname,fname
from EMPLOYEE order by fname limit 3

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
3 rows affected.

[('Jabbar', 'Ahmad'), ('Zelaya', 'Alicia'), ('Wong', 'Franklin')]

### user-defined variable을 사용하여 삽입 (Embedded SQL도 비슷하게 작동함)

In [76]:
%%sql

select ssn into @ssn from EMPLOYEE where lname = 'Borg' and fname = 'James';
select pnumber into @pno from PROJECT where pname = 'Computerization';
select @ssn, @pno;

insert into WORKS_ON values (@ssn, @pno, 10);

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [77]:
%sql select * from PROJECT

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
6 rows affected.

[('ProductX', 1, 'Bellaire', 5),
 ('ProductY', 2, 'Sugarland', 5),
 ('ProductZ', 3, 'Houston', 5),
 ('Computerization', 10, 'Stafford', 4),
 ('Reorganization', 20, 'Houston', 1),
 ('Newbenefits', 30, 'Stafford', 4)]

## Try this: transaction, commit/rollback in mysql client

#### Try this with mysql shell: sqlmagic is always autocommit
#### James Borg를 ProductX 프로젝트에 10시간 참여시킬 것.
```
\sql
\connect s202100001@dm.hufs.ac.kr
```
```
set autocommit=False;
select * from DEPENDENT;
delete from DEPENDENT;
rollback;
select * from DEPENDENT;
```
#### Deletion on DEPENDENT is ROLLBACKED
```
select * from DEPENDENT;
delete from DEPENDENT;
commit;
select * from DEPENDENT;
```
#### Deletion on DEPENDENT is COMMITTED; No way to revive them


## To try with transaction concurrecy control and isolation level, use two mysql shells

## LAB 10: ProductX에 참여하는 직원의 연봉을 10% 인상하시오.

In [78]:
%%sql 

update EMPLOYEE
set salary = salary * 1.1
where ssn in (select essn from WORKS_ON, PROJECT where pno = pnumber and pname = 'ProductX')

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
2 rows affected.

[]

## LAB 11: James Borg의 부하직원의 연봉을 10% 인상하시오.

In [79]:
%%sql
/* update 문장의 테이블을 where 절에 사용하면 semantics가 무한 순환 관계가 될 수 있음. 두 개의 SQL을 사용해야 함) */

update EMPLOYEE
set superssn = NULL
where ssn in (select e.ssn from EMPLOYEE e, EMPLOYEE s where s.fname = 'James' and s.lname = 'Borg' and e.superssn = s.ssn);

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
(pymysql.err.OperationalError) (1093, "You can't specify target table 'EMPLOYEE' for update in FROM clause")
[SQL: /* update 문장의 테이블을 where 절에 사용하면 semantics가 무한 순환 관계가 될 수 있음. 두 개의 SQL을 사용해야 함) */

update EMPLOYEE
set superssn = NULL
where ssn in (select e.ssn from EMPLOYEE e, EMPLOYEE s where s.fname = 'James' and s.lname = 'Borg' and e.superssn = s.ssn);]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

## Nested Query

## LAB 12: James의 부하 직원의 이름은? 중첩질의 사용

In [80]:
%%sql

select lname, fname
from EMPLOYEE
where superssn
         = (select ssn
             from EMPLOYEE
             where lname = 'Borg' and fname = 'James')

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
2 rows affected.

[('Wong', 'Franklin'), ('Wallace', 'Jennifer')]

## LAB 13: Houston에 사무실이 있는 부서명? 중첩질의 사용

In [81]:
%%sql

select distinct d.Dname
from DEPARTMENT d, DEPT_LOCATIONS de 
where d.Dnumber in (
  select de.Dnumber
  from DEPARTMENT d, DEPT_LOCATIONS de
  where d.Dnumber = de.Dnumber and de.Dlocation ='Houston' 
)

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
2 rows affected.

[('Headquarters',), ('Research',)]

## LAB 14: Houston과 Sugarland 모두에 사무실이 있는 부서명? 중첩질의 사용

In [82]:
%%sql

select distinct d.Dname
from DEPARTMENT d, DEPT_LOCATIONS de 
where d.Dnumber in (
  select de.Dnumber
  from DEPARTMENT d, DEPT_LOCATIONS de
  where d.Dnumber = de.Dnumber and de.Dlocation ='Sugarland' and d.Dnumber in (
  select de.Dnumber
  from DEPARTMENT d, DEPT_LOCATIONS de
  where d.Dnumber = de.Dnumber and de.Dlocation ='Sugarland' 
)
)

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
1 rows affected.

[('Research',)]

## LAB 15: 최고 급여를 받는 직원의 이름은?

In [83]:
%%sql

select e.lname, e.fname
from EMPLOYEE e
where not exists (select * from EMPLOYEE where salary > e.salary)

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
1 rows affected.

[('Borg', 'James')]

In [84]:
%%sql

select lname, fname
from EMPLOYEE e
where (e.salary  <ANY   (select salary from EMPLOYEE))

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
7 rows affected.

[('Smith', 'John'),
 ('Wong', 'Franklin'),
 ('English', 'Joyce'),
 ('Narayan', 'Ramesh'),
 ('Wallace', 'Jennifer'),
 ('Jabbar', 'Ahmad'),
 ('Zelaya', 'Alicia')]

## LAB 16: 최고 급여가 아닌 사람은?

In [85]:
%%sql

select lname, fname
from EMPLOYEE e
where (e.salary  <ANY   (select salary from EMPLOYEE))

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
7 rows affected.

[('Smith', 'John'),
 ('Wong', 'Franklin'),
 ('English', 'Joyce'),
 ('Narayan', 'Ramesh'),
 ('Wallace', 'Jennifer'),
 ('Jabbar', 'Ahmad'),
 ('Zelaya', 'Alicia')]

## LAB 17: 상관 중첩 질의: 자신의 부서에서 최고 급여를 받는 직원의 이름과 부서명은?

In [86]:
%%sql

select d.dname, e.lname, e.fname
from EMPLOYEE e, DEPARTMENT d
where e.dno = d.dnumber and (e.salary  >=ALL  (select f.salary from EMPLOYEE f where e.dno = f.dno))

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
3 rows affected.

[('Administration', 'Wallace', 'Jennifer'),
 ('Headquarters', 'Borg', 'James'),
 ('Research', 'Wong', 'Franklin')]

## LAB 18: James Borg의 부하직원의 이름은? (EXISTS 사용)

In [87]:
%%sql

select e.lname, e.fname
from EMPLOYEE e
where exists (
    select * 
    from EMPLOYEE j
    where e.superssn = j.ssn and j.lname = 'Borg' and j.fname = 'James'
)

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
2 rows affected.

[('Wong', 'Franklin'), ('Wallace', 'Jennifer')]

## LAB 19: Houston과 Sugarland 모두에 office가 있는 부서명은? (EXISTS 사용)

In [88]:
%%sql


select d.dname
from DEPARTMENT d
where 
EXISTS (
   select * 
   from DEPT_LOCATIONS dl
   where d.dnumber = dl.dnumber and dl.dlocation = 'Houston'
)
and
EXISTS (
   select * 
   from DEPT_LOCATIONS dl
   where d.dnumber = dl.dnumber and dl.dlocation = 'Sugarland'
);

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
1 rows affected.

[('Research',)]

## LAB 20: ProductX에 참여하지 않는 직원의 이름은?

In [89]:
%%sql

select e.fname, e.lname
from EMPLOYEE e
where NOT EXISTS 
(
   select * 
   from WORKS_ON w, PROJECT p
   where e.ssn = w.essn and w.pno = p.pnumber and p.pname = 'ProductX'
);

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
6 rows affected.

[('Franklin', 'Wong'),
 ('Ramesh', 'Narayan'),
 ('James', 'Borg'),
 ('Jennifer', 'Wallace'),
 ('Ahmad', 'Jabbar'),
 ('Alicia', 'Zelaya')]

## LAB 21: 4번 부서가 담당하는 모든 프로젝트에 참여하는 사원들의 이름은?

In [90]:
%%sql

select distinct CONCAT(e.Fname,' ',e.Minit,'.',' ', e.Lname) AS ename
from EMPLOYEE e, PROJECT p, WORKS_ON wo
where p.Dnum=4 and p.Pnumber=wo.Pno and e.Ssn=wo.Essn;

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
5 rows affected.

[('Franklin T. Wong',),
 ('James E. Borg',),
 ('Ahmad V. Jabbar',),
 ('Alicia J. Zelaya',),
 ('Jennifer S. Wallace',)]

## LAB 22: Administration 부서의 모든 직원이 참여하는 프로젝트 이름은?

In [91]:
%%sql

select p.pname
from PROJECT p
where
not exists (
    select * 
    from DEPARTMENT d, EMPLOYEE e
    where d.dname = 'Administration' and e.dno = d.dnumber and
    not exists (
        select *
        from WORKS_ON w
        where p.pnumber = w.pno and e.ssn = w.essn
    )
)

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
1 rows affected.

[('Newbenefits',)]

## LAB 23 직원과 직원의 상사가 있다면 그 상사의 이름들을 나열하시오.

In [92]:
%%sql

select e.fname, e.lname, s.fname as supervisor_fname, s.lname as supervisor_lname
from EMPLOYEE e left outer join EMPLOYEE s on e.superssn = s.ssn;

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
8 rows affected.

[('John', 'Smith', 'Franklin', 'Wong'),
 ('Franklin', 'Wong', 'James', 'Borg'),
 ('Joyce', 'English', 'Franklin', 'Wong'),
 ('Ramesh', 'Narayan', 'Franklin', 'Wong'),
 ('James', 'Borg', None, None),
 ('Jennifer', 'Wallace', 'James', 'Borg'),
 ('Ahmad', 'Jabbar', 'Jennifer', 'Wallace'),
 ('Alicia', 'Zelaya', 'Jennifer', 'Wallace')]

## TRY JOIN, LEFT OUTER JOIN, RIGHT OUTER JOIN, CROSS JOIN FOR YOURSELF

In [93]:
%%sql

select * from (DEPARTMENT natural join DEPT_LOCATIONS);

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
5 rows affected.

[(1, 'Headquarters', '888665555', datetime.date(1981, 6, 19), 'Houston'),
 (4, 'Administration', '987654321', datetime.date(1995, 1, 1), 'Stafford'),
 (5, 'Research', '333445555', datetime.date(1988, 5, 22), 'Bellaire'),
 (5, 'Research', '333445555', datetime.date(1988, 5, 22), 'Houston'),
 (5, 'Research', '333445555', datetime.date(1988, 5, 22), 'Sugarland')]

### Oracle, MySQL에서 from 절에 select 사용하기.

In [94]:
%%sql

select e.fname, e.lname
from (select * from EMPLOYEE where dno = 5) e
where e.salary >= 30000;

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
3 rows affected.

[('John', 'Smith'), ('Franklin', 'Wong'), ('Ramesh', 'Narayan')]

### 위를 흉내내서 Research 부서의 부서장의 이름은? outer select 문에 where 절 없이 작성

In [95]:
%%sql

select e.fname, e.lname
from (select * from DEPARTMENT where dname = 'Research') m 
     join 
     EMPLOYEE e 
     on e.ssn = m.mgrssn;

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
1 rows affected.

[('Franklin', 'Wong')]

## LAB 24: 최대급여를 받는 직원의 이름은? (Use aggregate function)

In [96]:
%%sql

select fname, lname
from EMPLOYEE 
where salary = (select max(salary) from EMPLOYEE);

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
1 rows affected.

[('James', 'Borg')]

## LAB 25: 부서별 최대급여를 받는 직원의 이름은? (Use aggregate function)

In [97]:
%%sql

select fname, lname
from EMPLOYEE e
where salary = (select max(salary) from EMPLOYEE where dno = e.dno);

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
3 rows affected.

[('Franklin', 'Wong'), ('James', 'Borg'), ('Jennifer', 'Wallace')]

## LAB 26: 2개의 PROJECT에 참여하는 직원의 이름은?

In [98]:
%%sql

select p.pnumber, p.pname, c
from PROJECT p, (select w.pno, count(*) c from WORKS_ON w group by w.pno) temp
where p.pnumber = temp.pno and temp.c = 2;

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
2 rows affected.

[(1, 'ProductX', 2), (3, 'ProductZ', 2)]

## LAB 27: 모든 PROJECT에 참여하는 직원의 이름은? (Using count; Never recommended)

Note: PK/FK 제약 조건에 의존하여 성립되는 질의임

In [99]:
%%sql

select e.Lname, count(*) 
from PROJECT p, WORKS_ON w, EMPLOYEE e
where p.Pnumber=w.Pno and w.Essn=e.Ssn
group by e.Ssn
having count(*)>=4

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
1 rows affected.

[('Wong', 4)]

## LAB 28: 직원별 참여 프로젝트 수는?

In [100]:
%%sql

select lname, fname, count(*)
from WORKS_ON, EMPLOYEE
where ssn = essn
group by ssn, lname, fname

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
8 rows affected.

[('Smith', 'John', 2),
 ('Wong', 'Franklin', 4),
 ('English', 'Joyce', 2),
 ('Narayan', 'Ramesh', 1),
 ('Borg', 'James', 2),
 ('Wallace', 'Jennifer', 2),
 ('Jabbar', 'Ahmad', 2),
 ('Zelaya', 'Alicia', 2)]

## LAB 29: 부양가족수가 2 이상 직원의 이름은?

In [101]:
%%sql

select lname, fname
from DEPENDENT, EMPLOYEE
where ssn = essn
group by ssn, lname, fname
having count(*) >= 2

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
2 rows affected.

[('Smith', 'John'), ('Wong', 'Franklin')]

## Creating Trigger: MySQL syntax

```
CREATE
    [DEFINER = { user | CURRENT_USER }]
    TRIGGER trigger_name
    trigger_time trigger_event
    ON tbl_name FOR EACH ROW
    trigger_body

trigger_time: { BEFORE | AFTER }

trigger_event: { INSERT | UPDATE | DELETE }
```

In [102]:
%sql drop table if exists salary_audit;

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
0 rows affected.

[]

In [103]:
%%sql

create table salary_audit (
  essn char(9),
  before_salary decimal(10,2),
  after_salary decimal(10,2),
  udatetime datetime
);

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
0 rows affected.

[]

In [104]:
%sql drop trigger if exists salary_audit_trig

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
0 rows affected.

[]

In [105]:
%%sql

create trigger salary_audit_trig
after update
on EMPLOYEE
for each row
begin
if new.salary <> old.salary then
	insert into salary_audit values (new.ssn, old.salary, new.salary, now());
end if;
end

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
0 rows affected.

[]

In [106]:
%%sql

update EMPLOYEE set salary = salary * 1.1 where dno = 5

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
4 rows affected.

[]

In [107]:
%sql select * from salary_audit;

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
4 rows affected.

[('123456789', Decimal('33000.00'), Decimal('36300.00'), datetime.datetime(2021, 12, 15, 23, 54, 11)),
 ('333445555', Decimal('40000.00'), Decimal('44000.00'), datetime.datetime(2021, 12, 15, 23, 54, 11)),
 ('453453453', Decimal('27500.00'), Decimal('30250.00'), datetime.datetime(2021, 12, 15, 23, 54, 11)),
 ('666884444', Decimal('38000.00'), Decimal('41800.00'), datetime.datetime(2021, 12, 15, 23, 54, 11))]

In [108]:
%sql select * from EMPLOYEE

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
8 rows affected.

[('John', 'B', 'Smith', '123456789', datetime.date(1965, 1, 9), '731-Fondren-Houston-TX', 'M', Decimal('36300.00'), '333445555', 5),
 ('Franklin', 'T', 'Wong', '333445555', datetime.date(1955, 12, 8), '638-Voss-Houston-TX', 'M', Decimal('44000.00'), '888665555', 5),
 ('Joyce', 'A', 'English', '453453453', datetime.date(1972, 7, 31), '5631-Rice-Houston-TX', 'F', Decimal('30250.00'), '333445555', 5),
 ('Ramesh', 'K', 'Narayan', '666884444', datetime.date(1962, 9, 15), '975-Fire-Oak-Humble-TX', 'M', Decimal('41800.00'), '333445555', 5),
 ('James', 'E', 'Borg', '888665555', datetime.date(1937, 11, 10), '450-Stone-Houston-TX', 'M', Decimal('55000.00'), None, 1),
 ('Jennifer', 'S', 'Wallace', '987654321', datetime.date(1941, 6, 20), '291-Berry-Bellaire-TX', 'F', Decimal('43000.00'), '888665555', 4),
 ('Ahmad', 'V', 'Jabbar', '987987987', datetime.date(1969, 3, 29), '980-Dallas-Houston-TX', 'M', Decimal('25000.00'), '987654321', 4),
 ('Alicia', 'J', 'Zelaya', '999887777', datetime.date(1968, 1, 19), '3321-Castle-Spring-TX', 'F', Decimal('25000.00'), '987654321', 4)]

### Test if stored procedure works

In [109]:
%sql drop procedure if exists p1;

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
0 rows affected.

[]

In [110]:
%%sql

create procedure p1()
    select 'Hello World';

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
0 rows affected.

[]

In [111]:
%sql call p1()

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
1 rows affected.

[('Hello World',)]

## Views

In [112]:
%sql drop view if exists WORKS_ON1;

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
0 rows affected.

[]

In [113]:
%%sql

CREATE VIEW WORKS_ON1 
AS
SELECT  FNAME, LNAME, PNAME, HOURS
FROM    EMPLOYEE, PROJECT, WORKS_ON
WHERE   SSN=ESSN AND PNO=PNUMBER;

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
0 rows affected.

[]

In [114]:
%%sql

SELECT FNAME, LNAME 
FROM   WORKS_ON1
WHERE  PNAME='ProductX';

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
2 rows affected.

[('John', 'Smith'), ('Joyce', 'English')]

In [115]:
%%sql

SELECT  table_name, is_updatable
FROM    information_schema.views

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
5 rows affected.

[('DEPT_VIEW', 'YES'),
 ('RESEARCH_DEPT_VIEW', 'YES'),
 ('PROJECT_VIEW', 'NO'),
 ('PROJECT_VIEW_GT2', 'NO'),
 ('WORKS_ON1', 'YES')]

## Derived Table

In [116]:
%%sql

/* derived table */
select dname, lname, fname
from (select ssn, lname, fname, dno from EMPLOYEE where sex = 'M') e 
     join DEPARTMENT on dno = dnumber

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
5 rows affected.

[('Research', 'Smith', 'John'),
 ('Research', 'Wong', 'Franklin'),
 ('Research', 'Narayan', 'Ramesh'),
 ('Headquarters', 'Borg', 'James'),
 ('Administration', 'Jabbar', 'Ahmad')]

## Common Table Expression(CTE)

In [117]:
%%sql
WITH first_level AS (
      SELECT ssn
      FROM EMPLOYEE WHERE superssn = '888665555'
    ),
    second_level AS (
      SELECT e.ssn
      FROM EMPLOYEE e JOIN first_level f ON f.ssn = e.superssn
    )
SELECT * FROM first_level UNION ALL SELECT * FROM second_level

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
7 rows affected.

[('333445555',),
 ('987654321',),
 ('123456789',),
 ('453453453',),
 ('666884444',),
 ('987987987',),
 ('999887777',)]

##  Recursive Common Table Expression(CTE)

In [118]:
%%sql

WITH RECURSIVE supervisees (essn) 
AS (
      SELECT '888665555'
      UNION ALL
      SELECT Ssn 
      FROM EMPLOYEE, supervisees 
      WHERE Superssn = essn
    )

 * mysql+pymysql://s201904458:***@dm.hufs.ac.kr:3306/s201904458db
(pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '' at line 8")
[SQL: WITH RECURSIVE supervisees (essn)
AS (
      SELECT '888665555'
      UNION ALL
      SELECT Ssn
      FROM EMPLOYEE, supervisees
      WHERE Superssn = essn
    )]
(Background on this error at: https://sqlalche.me/e/14/f405)